<!doctype html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport"
          content="width=device-width, user-scalable=no, initial-scale=1.0, maximum-scale=1.0, minimum-scale=1.0">
    <meta http-equiv="X-UA-Compatible" content="ie=edge">
    <title>Document</title>
</head>
<body>
<img src="" alt="">

<?php
//1. При помощи цикла for выведите все нечетные числа от 1 до 50;


/*for($i=1;$i<=50;$i++){
    if($i%2==0){
        echo "{$i} <br>";
    };
};*/
//----------------------------------------------------------------------------------------------------------------------

//2. При помощи цикла while вывести список категорий. Результат Категория 1, Категория 2, и т.д.;

/*$category = "Категория";
$num = 1;

while ($num < 5){
    echo "{$category} {$num} <br>";
    $num++;
};*/
//----------------------------------------------------------------------------------------------------------------------

//3. Написать скрипт, который выведет Заголовок, Дату и Имя автора, Картину поста (цикл while);

/*$post = 0;
$img =1;
$date = date("d M Y");
while ($post <5){
    echo "<h1>Заголовок поста</h1><br>{$date}<h3>Буланов Глеб Александрович</h3><br><img src=\"{$img}.png\" alt=\"\">";
    $post++;
    $img++;
};*/
//----------------------------------------------------------------------------------------------------------------------

//4. При помощи цикла foreach вывести список категорий. Результат Категория 1, Категория 2, и т.д.

/*$arr = ['Категория 1','Категория 2','Категория 3','Категория 4','Категория 5','Категория 6'];

foreach ($arr as $category ){
    echo $category . "<br>";
}*/

//----------------------------------------------------------------------------------------------------------------------

//5. Написать скрипт вывода формы, в котором задействовать подключение конструкци require_once;
//require_once ('forms.php');


//6. Задача. Переменная $lang может принимать два значения: 'ru' и 'en'. Если она имеет значение 'ru', то в переменную $arr запишем массив дней недели на русском языке, а если имеет значение 'en' – то на английском. Решите задачу через 2 if, через switch-case.

/*$lang = 'ru';
$arr=[];


if($lang=='ru'){
    switch ($lang){
        case 'ru':
            $arr[0]= 'Понедельник';
        case 'ru':
            $arr[1]='Вторник';
        case 'ru':
            $arr[2]= 'Среда';
        case 'ru':
            $arr[3]= 'Четверг';
        case 'ru':
            $arr[4]= 'Пятница';
        case 'ru':
            $arr[5]= 'Суббота';
        case 'ru':
            $arr[6]= 'Воскресенье';
            echo "{$arr[0]}<br>{$arr[1]}<br>{$arr[2]}<br>{$arr[3]}<br>{$arr[4]}<br>{$arr[5]}<br>{$arr[6]}<br>";
    }
}
if($lang=='en') {
    switch ($lang) {
        case 'en':
            $arr[0] = 'Monday';
        case 'en':
            $arr[1] = 'Tuesday';
        case 'en':
            $arr[2] = 'Wednesday';
        case 'en':
            $arr[3] = 'Thursday';
        case 'en':
            $arr[4] = 'Friday';
        case 'en':
            $arr[5] = 'Saturday';
        case 'en':
            $arr[6] = 'Sunday';
            echo "{$arr[0]}<br>{$arr[1]}<br>{$arr[2]}<br>{$arr[3]}<br>{$arr[4]}<br>{$arr[5]}<br>{$arr[6]}<br>";
    }
}*/
//----------------------------------------------------------------------------------------------------------------------

// 7.Заполните массив следующим образом: в первый элемент запишите 'x', во второй 'xx', в третий 'xxx' и так далее.

/*$arr = [];
$string = 'х';
for ($i = 0; $i < 5; $i++) {
    $arr[] = $string;
    $string .= 'x';
}*/
//----------------------------------------------------------------------------------------------------------------------

// Дан массив с числами. Узнайте сколько элементов с начала массива надо сложить, чтобы в сумме получилось больше 10-ти. Считайте, что в массиве есть нужное количество элементов

/*$numbers = [2,1,1,2,1,7,4,3,2,8];
$amount = 0;
$number =0;

foreach ($numbers as $num){
    if($amount >= 10){
        echo "Что бы получить 10 или больше потребовалось {$number} элементов массива";
        break;
    };
    $number++;
    $amount += $num;
};*/



?>

</body>
</html>