<!doctype html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport"
          content="width=device-width, user-scalable=no, initial-scale=1.0, maximum-scale=1.0, minimum-scale=1.0">
    <meta http-equiv="X-UA-Compatible" content="ie=edge">
    <title>Document</title>
</head>
<body>

<?php
//1.Создайте переменную $var и присвойте ей значение 'hello'. Обращаясь к отдельным символам этой строки выведите на экран символ 'h', символ 'e', символ 'o'.

/*$word = "hello";
echo "{$word[0]}<br> {$word[1]}<br> {$word[4]} ";*/
//----------------------------------------------------------------------------------------------------------

//2.Создайте переменную $a и присвойте ей значение 3. Выведите значение этой переменной на экран.

/*$numder = 3;
echo $numder;*/
//--------------------------------------------------------------------------------------------------------------

//3.Создайте переменные $a=10 и $b=2. Выведите на экран их сумму, разность, произведение и частное (результат деления)

/*$a=10;
$b=2;

echo $a/$b;*/
//-------------------------------------------------------------------------------------------------------------

//4.Создайте переменные $c=15 и $d=2. Просуммируйте их, а результат присвойте переменной $result. Выведите на экран значение переменной $result.

/*$c=15;
$d=2;
$result = $c+$d;
echo $result;*/
//----------------------------------------------------------------------------------------------------------------


//5.Создайте переменные $a=17 и $b=10. Отнимите от $a переменную $b и результат присвойте переменной $c. Затем создайте переменную $d, присвойте ей значение 7. Сложите переменные $c и $d, а результат запишите в переменную $result. Выведите на экран значение переменной $result.

/*$a = 17;
$b = 10;
$c = $a-$b;
$d = 7;
$result = $c + $d;
echo $result*/;
//--------------------------------------------------------------------------------------------------------------------


//6.Напишите скрипт, который считает количество секунд в часе.
/*$hours = 1;
$minutePerHour = 60;
$secPerMenute = 60;

$secPerHour = $hours * $minutePerHour * $secPerMenute;
echo $secPerHour;*/
//----------------------------------------------------------------------------------------------------------------------

//7.Переделайте приведенный код так, чтобы в нем использовались операции +=, -=, *=, /=, ++, --. Количество строк кода при этом не должно измениться. Код для переделки


	/*$var = 1;
	$var +=12;
	$var -=14;
	$var *=5;
	$var /=7;
	$var += 1;
	$var -= 1;
	echo $var;*/
//-----------------------------------------------------------------------------------------------------------

//8. Создайте переменную $age и присвойте ей ваш возраст. Выведите на экран 'Мне %Возраст% лет!'

/*$age = 27;
echo "<h1>Мне {$age} лет</h1>";*/
//--------------------------------------------------------------------------------------------------------------

//9.  Создайте переменную $num и присвойте ей значение '12345'. Найдите сумму цифр этого числа.

/*$num = '12345';
$sum = $num[0]+$num[1]+$num[2]+$num[3]+$num[4];
echo $sum;*/
//----------------------------------------------------------------------------------------------------------------------
?>


</body>
</html>